above
action
afternoon
airplane
along
angry
animal
answer
apple
appreciate
april
arm
ask
attack
attention
automobile
baby
back
ball
banana
bank
baseball
basket
beach
bear
beautiful
bed
bedroom
bee
begin
believe
belt
bicycle
big
bike
bird
bite
black
blame
blink
blouse
blow
blue
blueberry
boat
book
boom
bottom
bowl
box
boy
brave
bread
breathe
bridge
bright
brother
brought
bug
build
bus
busy
butterfly
button
bye
cake
calm
camera
candle
candy
caps
car
careful
carpet
carry
cat
catch
ceiling
cereal
chair
chalk
challenge
champion
change
cheer
cheese
child
choice
choose
chore
circle
city
clean
clear
climb
clock
close
cloth
cloud
clouds
coat
cold
collect
color
come
comfortable
command
computer
consider
cook
cool
correct
couch
count
courage
cow
crawl
critic
cry
cup
dad
dance
dare
dark
day
delicious
desk
dirty
disagree
dog
doll
dollar
door
doorway
down
draw
dress
drink
drive
driver
dry
duck
ear
early
eat
egg
elephant
end
enjoy
evening
eye
eyes
face
fair
fame
familiar
family
fast
father
feed
feel
final
find
finger
fire
first
fish
flag
flash
flat
float
floor
flow
flower
fly
focus
follow
food
foot
football
fork
found
foundation
friend
friends
frog
front
full
funny
game
garden
gift
girl
give
glass
go
grape
grass
green
grill
guide
guitar
hair
hallway
hamburger
hammer
hand
happy
hat
hear
heart
heat
heavy
help
high
hold
home
honest
hope
hot
house
hug
hungry
ice
ice cream
idea
inside
instruction
instrument
interesting
jacket
jazz
jelly
juice
jump
kangaroo
keep
key
keyboard
kick
kind
kiss
kitchen
kite
knee
knife
knock
knowledge
lake
lamp
language
large
larger
last
late
later
laugh
lead
learn
left
leg
lemon
level
lick
light
like
lion
listen
lived
look
love
lovely
low
make
man
mark
market
math
maybe
meal
memory
milk
mom
moon
morning
mother
mountain
mouse
mouth
move
movie
music
nail
name
night
no
noise
nose
note
number
observe
ocean
off
old
on
open
opener
orange
outside
oven
paint
pants
paper
park
pass
pen
pencil
people
period
phone
photo
piano
picture
pillow
pineapple
pizza
place
plane
plant
plate
play
please
poem
point
potato
potential
pretty
problem
produce
pull
pump
puppy
purple
push
puzzle
queen
quick
quiet
rabbit
rain
raincoat
reach
read
ready
red
refrigerator
remember
repair
repeat
respect
restaurant
result
rice
ride
right
risk
risky
river
road
rock
room
rope
round
run
sad
safe
sail
sand
sandwich
say
school
sea
see
select
sentence
shade
shadow
share
sheep
ship
shirt
shoe
shoes
shop
short
shout
show
sign
silent
sing
single
sister
sit
sky
sleep
sleepy
slow
small
smaller
smile
snow
soccer
sock
sofa
song
soon
sound
space
speak
speaker
speech
spell
spend
spider
spoon
square
stand
star
stay
stop
store
straw
strawberry
street
structure
student
study
summer
sun
sweet
swim
swing
table
take
talk
tall
taste
tasty
teach
teacher
team
telephone
television
test
think
throw
toast
today
together
tomorrow
top
touch
towel
town
toy
tradition
train
travel
tree
truck
try
tv
ugly
umbrella
under
understand
up
used
vacuum
van
wait
wake
walk
wall
wash
watch
water
watermelon
wave
white
wind
window
wing
wish
woman
woods
word
work
write
wrong
x-ray
xylophone
yard
yellow
yes
yesterday
young
zebra
zipper
zoo
